# Fictitious Names

### Introduction:

This time you will create a data again 

Special thanks to [Chris Albon](http://chrisalbon.com/) for sharing the dataset and materials.
All the credits to this exercise belongs to him.  

In order to understand about it go [here](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/).

### Step 1. Import the necessary libraries

In [1]:
import numpy as np 
import pandas as pd

### Step 2. Create the 3 DataFrames based on the following raw data

In [2]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

### Step 3. Assign each to a variable called data1, data2, data3

In [3]:
data1 = pd.DataFrame(raw_data_1)
data2 = pd.DataFrame(raw_data_2)
data3 = pd.DataFrame(raw_data_3)

### Step 4. Join the two dataframes along rows and assign all_data

In [4]:
all_data = pd.concat([data1,data2, data3])

In [5]:
all_data.head()

  subject_id first_name last_name  test_id
0          1       Alex  Anderson      NaN
1          2        Amy  Ackerman      NaN
2          3      Allen       Ali      NaN
3          4      Alice      Aoni      NaN
4          5     Ayoung   Atiches      NaN

### Step 5. Join the two dataframes along columns and assign to all_data_col

In [11]:
all_df = [data1,data2, data3]

all_data_col = pd.concat(all_df, axis = 1 )

In [12]:
all_data_col.head()

,subject_id,first_name,last_name,subject_id,first_name,last_name,subject_id,test_id
0,1,Alex,Anderson,4,Billy,Bonder,1,51
1,2,Amy,Ackerman,5,Brian,Black,2,15
2,3,Allen,Ali,6,Bran,Balwner,3,15
3,4,Alice,Aoni,7,Bryce,Brice,4,61
4,5,Ayoung,Atiches,8,Betty,Btisan,5,16

### Step 6. Print data3

### Step 7. Merge all_data and data3 along the subject_id value

### Step 8. Merge only the data that has the same 'subject_id' on both data1 and data2

### Step 9. Merge all values in data1 and data2, with matching records from both sides where available.